const myColor = "#EFBE0E";
/* const myColor = "#2602f5"; */
export const allColors = {
  /*   navText: "rgba(236, 215, 184, 1)", */
  navText: "#ebecff",
  gradientBg: `linear-gradient(180deg, ${myColor} 0%, rgba(30, 16, 3, 0) 225.77%), linear-gradient(0deg, #E2E8F0, #E2E8F0)`,
  gradientBg2: `linear-gradient(180deg, ${myColor} 0%, rgba(30, 16, 3, 0) 225.77%)`,
  /*  backgroundMain: "rgba(30, 16, 3, 0.6)", */
  backgroundMain: "rgba(0, 39, 255, 0.6)",
  backgroundWhite: "rgba(255,255,255, .6)",
  mainTitleW: "rgba(255, 255, 255, 1)",
  mainTitleB: "rgba(0, 0, 0, 1)",
  subTitle: "rgba(226, 232, 240, 1)",
  /*   subTitle2: "rgba(111, 148, 156, 1)", */
  subTitle2: "#C1D7E3",
  buttonCol: `linear-gradient(0deg, ${myColor}, rgba(236, 215, 184, .2))`,
  buttonText: "rgba(255, 255, 255, 1)",
  buttonHover: "linear-gradient(0deg, rgba(199, 0, 4, 1), rgba(199, 0, 4, .2))",
  shadowBox: `${myColor} 0px 5px 15px`,
  shadowText: "0px 5px 15px rgba(236, 215, 184, .6)",
  beforeBg:
    "linear-gradient(180deg, rgba(30, 16, 3, .65) 0%, rgba(255,255,255, 0) 100%)",
  afterBg:
    "linear-gradient(180deg, rgba(255,255,255, 0) 0%, rgba(30, 16, 3, .2) 100%)",
  beforeBgB:
    "linear-gradient(180deg, rgba(255, 255, 255, .5) 0%, rgba(30, 16, 3, .1) 100%)",
  afterBgB:
    "linear-gradient(180deg, rgba(255,255,255, 0) 0%, rgba(30, 16, 3, .65) 100%)",
};

export const texts = {
  ukr: {
    hero: {
      title: "РЕМРЕСУРС",
      subtitle: "Тут досвід зустрічається з технологічними рішеннями",
      description:
        "Ми є уповноваженими представниками у сфері ремонту кранового обладнання, металообробки, лиття, а також надаємо комплексні послуги з ремонту обладнання для промислових підприємств та атомної енергетики. Наша команда пишається багаторічним досвідом у цих ключових сферах, забезпечуючи надійність та якість у кожному проекті. Ми також спеціалізуємося на ремонті машин, установок, та постачанні необхідних комплектуючих для залізничного транспорту в Україні.",
      btn: "Докладніше",
    },
    second: {
      title: "ПРО НАС",
      subTitle:
        "Вітаємо вас на нашому сайті, де ваш успіх – наш пріоритет. Ми надаємо не тільки послуги з ремонту кранового обладнання, металообробки, лиття, та обслуговування обладнання для промислових підприємств та атомної енергетики, але й втілюємо ваш потенціал у реальність. Наша компанія пишається партнерством з найбільшими постачальниками та виробниками, які завоювали довіру в цих галузях. Працюючи з нами, ви можете бути впевнені в використанні передових технологій, підтримці великих брендів та індивідуальному підході до кожного проекту. Довіртеся досвіду та надійності – ваш бізнес заслуговує найкращого.",
    },
    third: {
      title: "Обираючи нас, ви відкриваєте двері до низки ключових переваг:",
      content: [
        {
          title: "Досвід та експертиза:",
          subtitle:
            "Наша команда володіє багаторічним досвідом у сфері ремонту та обслуговування обладнання. Ми знаємо, як ефективно вирішувати складні завдання.",
        },
        {
          title: "Індивідуальний підхід:",
          subtitle:
            "Ми цінуємо кожного клієнта і підходимо до кожного проекту індивідуально, враховуючи унікальні потреби та вимоги.",
        },
        {
          title: "Глобальні партнерства:",
          subtitle:
            "Співпраця з найбільшими постачальниками та виробниками в галузі обладнання забезпечує доступ до передових технологій та високоякісних комплектуючих.",
        },
        {
          title: "Надійність та гарантії:",
          subtitle:
            "Ми прагнемо до вищого стандарту надійності. Ваші проекти в надійних руках, підтримувані гарантіями якості.",
        },
      ],
    },
    four: {
      title:
        "Обираючи нас, ви вибираєте надійного партнера для реалізації ваших проектів у сфері ремонту та обслуговування промислового обладнання.",
      content: [
        {
          title: "Системний підхід до рішень:",
          subtitle:
            "Ми пропонуємо комплексний погляд на ваші потреби, здійснюючи системний підхід до ремонту та обслуговування обладнання. Це дозволяє нам реалізовувати проекти більш ефективно і знижувати ризики.",
        },
        {
          title: "Інженерні рішення на передовому рівні:",
          subtitle:
            "Наша команда інженерів постійно стежить за останніми технологічними трендами, надаючи інноваційні рішення для ремонту, обслуговування та модернізації обладнання. Ми прагнемо до постійного вдосконалення та оптимізації процесів.",
        },
        {
          title: "Партнерство з європейськими виробниками:",
          subtitle:
            "Наша компанія пишається встановленими партнерськими відносинами з провідними європейськими виробниками обладнання. Це забезпечує нам доступ до передових технологій, високоякісних комплектуючих та експертної підтримки, що позитивно позначається на результаті кожного проекту.",
        },
      ],
    },
    five: [
      {
        title:
          "Експертиза у виробництві стрілкових переводів та хрестовин для електротранспорту:",
        description:
          "Наша компанія пишається багаторічним досвідом у успішному виробництві та установці стрілкових переводів та хрестовин для комунального електротранспорту. Ми здійснюємо кожен етап проекту з високою мірою професіоналізму та уваги до деталей.",
      },
      {
        title: "Використання європейських комплектуючих:",
        description:
          "Ми підтримуємо високі стандарти якості, використовуючи європейські комплектуючі у виробництві. Це гарантує надійність і довгий термін служби наших стрілкових переводів, відповідаючи всім сучасним стандартам безпеки та ефективності.",
      },
      {
        title: "Технологічні рішення та інновації:",
        description:
          "Застосування передових технологій та інноваційних рішень у наших проектах дозволяє нам надавати клієнтам оптимальні стрілкові переводи, що забезпечують плавне та безпечне рух електротранспорту.",
      },
    ],
    sixis:
      "Вибравши нас, ви отримуєте не просто продукт, а комплексне рішення, що поєднує у собі європейську якість, технологічну експертизу та довгострокову надійність.",
    partners: {
      title:
        "Наша компанія ТОВ РЕМРЕСУРС є уповноваженим представником із постачання обладнання, матеріалів, робіт та послуг наступних підприємств:",
      partnersList: [
        {
          title: "ТОВ «Укрспецсервіс»",
          description: `Спеціалізоване електроремонтне підприємство з багаторічним досвідом ремонту електричних машин включає Дніпропетровське підприємство (виробничі площі 12 500 кв.м), Покровське підприємство (виробничі площі 2500 кв.м). Підприємство оснащене вантажопідйомними засобами до 40 т, всім спеціалізованим обладнанням для ремонту електричних машин, металорізальним обладнанням, що дозволяє обробляти вироби діаметром до 1800 мм та завдовжки до 7000 мм, балансувальним обладнанням, атестованою випробувальною силою, лазерними установками та багато.
          Система якості на підприємстві атестована відповідно до стандарту ДСТУ ISO 9001:2009.
          Підприємство має всю потрібну дозвільну документацію. Також має партнерські відносини із найбільшими електромашинобудівними підприємствами України.
          Підприємство пропонує послуги з ремонту електричних машин будь-яких типів та потужностей до 60 000 кВт включно.`,
          link: "https://uss.dp.ua/",
          img: "images/partners/ukrspec.png",
        },
        /*         {
          title: "ТОВ «Техінвест-пром»",
          description: `Є постачальником металопрокату для енергетичного машинобудування, а також спеціалізується на виготовленні елементів, деталей та складальних одиниць трубопроводів для ТЕС, АЕС та підприємств металургійного, хімічного та харчового комплексу (залежно від призначення трубопроводів та параметрів транспортованого середовища (гаряча вода, пара, олія та інші) середовища).`,
          link: "https://omtz.prom.ua/",
          img: '',e
        }, */
        {
          title: "ТОВ «Рапід Сервіс»",
          description: `Продаж обладнання (Газові котли будь-якої потужності, Твердопаливні котли потужністю до 5 МВт. Запірна арматура та інші елементи котелень. Насоси циркуляційні, підвищувальні та фекальні).
          Проектування. Котельні. Насосні вузли. Теплопункти.
          Монтаж. Діагностика, ремонт, сервісне обслуговування, пусконалагоджувальні роботи.
          Виробництво котельного обладнання: Твердопаливні казани. Модульні котельні. Системи паливоподачі для твердопаливних котлів (склади «живе дно», силоси, норії, транспортери, шнеки). Пелетні пальники та топки котлів. Системи автоматичного керування котлів. Системи пневматичного очищення казанів. Станції підвищення тиску (водоканали та багатоповерхові будівлі). Будь-які шафи керування. Системи диспетчеризації та віддаленого доступу за будь-якими технологічними процесами.`,
          link: "https://rapid.dp.ua/",
          img: "images/partners/repid.png",
        },
        {
          title: "ТОВ «Дніпровський завод технологічного обладнання»",
          description: `Ливарно-механічне підприємство повного циклу спеціалізується на виготовленні широкого асортименту сталевого, чавунного лиття різних марок та деталей з механічною обробкою для машинобудівної промисловості. 	Наявність універсальної системи підготовки виробництва дозволяє у найкоротші терміни освоювати нові високотехнологічні види продукції з мінімальними припусками на механічну обробку за кресленнями або зразками замовника та виконувати різноманітні замовлення на лиття. Підприємство упродовж багатьох років є членом Асоціації ливарників України.`,
          link: "https://dzto.dp.ua/",
          img: "images/partners/dzto.webp",
        },
        {
          title: "ТОВ «Тавріда електрік Дніпро»",
          description: `Компанія здійснює продаж, а також авторизований гарантійний супровід та ліцензійне виготовлення електротехнічного обладнання ТМ «TEL» для автоматизації ліній електропередачі: - Вакуумний вимикач серії ВВ/TEL-10 - Комутаційні модулі КМ/TEL з вакуумним вимикачем ВВ/TEL-10 - Викочування ВЕ в зборі з вакуумним вимикачем ВВ/TEL-10 - Реклоузер вакуумний серії РВА/TEL-10 - Комплектні розподільні пристрої (КРУ) серії SG_MILE - Обмежувач перенапруг нелінійний серії ОПН/TEL Одним із основних видів діяльності компанії «Таврида Електрик Дніпро» є виконання комплексу робіт з будівництва, реконструкції та модернізації електроенергетичних об'єктів: - Інжиніринг • Технічне обстеження об'єкта будівництва/реконструкції/модернізації • Підготовка рекомендацій щодо оптимального виконання робіт • Розробка проектних рішень відповідно до технічного завдання Замовника • Здійснення технічного нагляду за виконанням робіт • Розробка остаточної виконавчої роботи за фактом виконання робіт - Ретрофіт • Інсталяція обладнання на основі вимикачів ВВ/TEL-10 • Монтаж додаткового обладнання після ретрофіту - Випробувальна лабораторія • Приймально-здавальні випробування обладнання власного виробництва • Випробування та перевірки всього обладнання після монтажу Замовника.`,
          link: "https://tavrida-elektrik.prom.ua/",
          img: "images/partners/ted.webp",
        },
        {
          title: "ПрАТ «Запоріжтрансформатор»",
          description: `Найбільші в Україні та Європі підприємства з виробництва силових масляних трансформаторів та електричних реакторів із виробничою потужністю 60 тис. МВА на рік, сконцентрованою на одному виробничому майданчику. Номенклатура продукції ПрАТ «ЗТР» включає силові масляні трансформатори різного призначення від 1 до 1250 МВА на класи напруги від 10 кВ до 1150 кВ включно, електричні реактори та керовані шунтуючі реактори.`,
          link: "http://www.ztr.ua/",
          img: "images/partners/ztr.gif",
        },
        {
          title: "ТОВ “Укрелектроапарат»",
          description: `Провідне підприємство трансформаторобудування України, країн СНД, а на Поділлі – лідер серед промислових підприємств, обличчя і візитна картка регіонального електротехнічного машинобудування.
          За роки роботи підприємства співробітниками накопичений величезний досвід конструювання і виробництва трансформаторного обладнання, що в поєднанні з потужною, сучасною, виробничою та науково-конструкторською базою, дозволяє виконувати замовлення будь-якої складності, задовольняючи всі вимоги замовника.
          Організований повний технологічний цикл з виробництва електротехнічної продукції – від металообробки, виготовлення металоконструкцій до готових до реалізації трансформаторів і комплектних трансформаторних підстанцій потужністю від 10 до 4000 кВА, трансформаторів сухих, реакторів для електровозів і електропоїздів, спеціальних трансформаторів малої потужності, камер збірних і щитів одностороннього обслуговування, газорегуляторних пунктів.
          Сучасна виробнича база, унікальні технології, високий технічний рівень організації виробництва, співпраця з провідними електротехнічними підприємствами світу, дають можливість освоювати нові види продукції та вдосконалювати виробництво обладнання, розширюючи номенклатуру та сфери його використання.`,
          link: "https://uea.com.ua/",
          img: "images/partners/electroaparat.png",
        },
        {
          title: "Компанія «ПТЕ-КРАН»",
          description: `Виготовляє, монтує та обслуговує вантажопідйомне обладнання в Україні, країнах СНД та Східній Європі. 
          Спеціалізація - складська вантажопідйомна техніка, крани всіх модифікацій та комплектуючі до них.
          Компанія «ПТЕ-КРАН» - завод кранового обладнання з досвідченими співробітниками та сучасною виробничою базою.
          Асортимент вантажопідйомного обладнання для складу
          Список продукції:
          кран-балки;
          опорні однобалочні та двобалочні крани;
          підвісні однобалочні крани;
          підйомна техніка спецпризначення;
          ручні крани;
          передавальні та кранові візки;
          підкранові шляхи та естакади;
          комплектуючі для кранів: захвати, траверси, пересувні тупикові упори, блок-колеса та інше.
          Кожен вид обладнання може бути спроектований за індивідуальними кресленнями. Окрім виробництва, компанія «ПТЕ-КРАН» доставляє, монтує та готує до використання складську вантажопідйомну техніку.`,
          link: "https://www.pte-crane.com.ua/",
          img: "images/partners/ptekran.png",
        },
      ],
    },
    contacts: {
      title: "Залишились питання? Зв'яжіться з нами!",
      teltext: "Телефонуйте нам:",
      tel: "+38(098)-865-00-07",
      tel1: "+38(067)-523-33-30",
      subtitle: "Пишіть нам на пошту:",
      mail: "tov.remresurs@gmail.com",
      description: "Юридична та поштова адреса:",
      adres: "49000, м. Дніпро, Аеродром 8",
    },
    footers: {
      rights: "© 2024 РЕМРЕСУРС. Всі права захищені.",
      erdp: "ЄДРПОУ 39041002",
    },
    company: "РЕМРЕСУРС",
    navlinks: ["Головна", "Про нас", "Переваги", "Партнери", "Контакти"],
  },
  eng: {},
};
