const myColor = "#2602f5";
export const allColors = {
  /*   navText: "rgba(236, 215, 184, 1)", */
  navText: "#ebecff",
  gradientBg: `linear-gradient(180deg, ${myColor} 0%, rgba(30, 16, 3, 0) 225.77%), linear-gradient(0deg, #E2E8F0, #E2E8F0)`,
  gradientBg2: `linear-gradient(180deg, ${myColor} 0%, rgba(30, 16, 3, 0) 225.77%)`,
  /*  backgroundMain: "rgba(30, 16, 3, 0.6)", */
  backgroundMain: "rgba(0, 39, 255, 0.6)",
  backgroundWhite: "rgba(255,255,255, .6)",
  mainTitleW: "rgba(255, 255, 255, 1)",
  mainTitleB: "rgba(0, 0, 0, 1)",
  subTitle: "rgba(226, 232, 240, 1)",
  /*   subTitle2: "rgba(111, 148, 156, 1)", */
  subTitle2: "#C1D7E3",
  buttonCol: `linear-gradient(0deg, ${myColor}, rgba(236, 215, 184, .2))`,
  buttonText: "rgba(255, 255, 255, 1)",
  buttonHover: "linear-gradient(0deg, rgba(199, 0, 4, 1), rgba(199, 0, 4, .2))",
  shadowBox: `${myColor} 0px 5px 15px`,
  shadowText: "0px 5px 15px rgba(236, 215, 184, .6)",
  beforeBg:
    "linear-gradient(180deg, rgba(30, 16, 3, .65) 0%, rgba(255,255,255, 0) 100%)",
  afterBg:
    "linear-gradient(180deg, rgba(255,255,255, 0) 0%, rgba(30, 16, 3, .2) 100%)",
  beforeBgB:
    "linear-gradient(180deg, rgba(255, 255, 255, .5) 0%, rgba(30, 16, 3, .1) 100%)",
  afterBgB:
    "linear-gradient(180deg, rgba(255,255,255, 0) 0%, rgba(30, 16, 3, .65) 100%)",
};

export const texts = {
  ukr: {
    hero: {
      title: "РЕМРЕСУРС",
      subtitle: "Тут досвід зустрічається з технологічними рішеннями",
      description:
        "Ми є провідними посередниками у сфері ремонту кранового обладнання, металообробки, лиття, а також надаємо комплексні послуги з ремонту обладнання для промислових підприємств та атомної енергетики. Наша команда пишається багаторічним досвідом у цих ключових сферах, забезпечуючи надійність та якість у кожному проекті. Ми також спеціалізуємося на ремонті машин, установок, та постачанні необхідних комплектуючих для залізничного транспорту в Україні.",
      btn: "Докладніше",
    },
    second: {
      title: "ПРО НАС",
      subTitle:
        "Вітаємо вас на нашому сайті, де ваш успіх – наш пріоритет. Ми надаємо не тільки послуги з ремонту кранового обладнання, металообробки, лиття, та обслуговування обладнання для промислових підприємств та атомної енергетики, але й втілюємо ваш потенціал у реальність. Наша компанія пишається партнерством з найбільшими постачальниками та виробниками, які завоювали довіру в цих галузях. Працюючи з нами, ви можете бути впевнені в використанні передових технологій, підтримці великих брендів та індивідуальному підході до кожного проекту. Довіртеся досвіду та надійності – ваш бізнес заслуговує найкращого.",
    },
    third: {
      title: "Обираючи нас, ви відкриваєте двері до низки ключових переваг:",
      content: [
        {
          title: "Досвід та експертиза:",
          subtitle:
            "Наша команда володіє багаторічним досвідом у сфері ремонту та обслуговування обладнання. Ми знаємо, як ефективно вирішувати складні завдання.",
        },
        {
          title: "Індивідуальний підхід:",
          subtitle:
            "Ми цінуємо кожного клієнта і підходимо до кожного проекту індивідуально, враховуючи унікальні потреби та вимоги.",
        },
        {
          title: "Глобальні партнерства:",
          subtitle:
            "Співпраця з найбільшими постачальниками та виробниками в галузі обладнання забезпечує доступ до передових технологій та високоякісних комплектуючих.",
        },
        {
          title: "Надійність та гарантії:",
          subtitle:
            "Ми прагнемо до вищого стандарту надійності. Ваші проекти в надійних руках, підтримувані гарантіями якості.",
        },
      ],
    },
    four: {
      title:
        "Обираючи нас, ви вибираєте надійного партнера для реалізації ваших проектів у сфері ремонту та обслуговування промислового обладнання.",
      content: [
        {
          title: "Системний підхід до рішень:",
          subtitle:
            "Ми пропонуємо комплексний погляд на ваші потреби, здійснюючи системний підхід до ремонту та обслуговування обладнання. Це дозволяє нам реалізовувати проекти більш ефективно і знижувати ризики.",
        },
        {
          title: "Інженерні рішення на передовому рівні:",
          subtitle:
            "Наша команда інженерів постійно стежить за останніми технологічними трендами, надаючи інноваційні рішення для ремонту, обслуговування та модернізації обладнання. Ми прагнемо до постійного вдосконалення та оптимізації процесів.",
        },
        {
          title: "Партнерство з європейськими виробниками:",
          subtitle:
            "Наша компанія пишається встановленими партнерськими відносинами з провідними європейськими виробниками обладнання. Це забезпечує нам доступ до передових технологій, високоякісних комплектуючих та експертної підтримки, що позитивно позначається на результаті кожного проекту.",
        },
      ],
    },
    five: [
      {
        title:
          "Експертиза у виробництві стрілкових переводів та хрестовин для електротранспорту:",
        description:
          "Наша компанія пишається багаторічним досвідом у успішному виробництві та установці стрілкових переводів та хрестовин для комунального електротранспорту. Ми здійснюємо кожен етап проекту з високою мірою професіоналізму та уваги до деталей.",
      },
      {
        title: "Використання європейських комплектуючих:",
        description:
          "Ми підтримуємо високі стандарти якості, використовуючи європейські комплектуючі у виробництві. Це гарантує надійність і довгий термін служби наших стрілкових переводів, відповідаючи всім сучасним стандартам безпеки та ефективності.",
      },
      {
        title: "Технологічні рішення та інновації:",
        description:
          "Застосування передових технологій та інноваційних рішень у наших проектах дозволяє нам надавати клієнтам оптимальні стрілкові переводи, що забезпечують плавне та безпечне рух електротранспорту.",
      },
    ],
    sixis:
      "Вибравши нас, ви отримуєте не просто продукт, а комплексне рішення, що поєднує у собі європейську якість, технологічну експертизу та довгострокову надійність.",
    contacts: {
      title: "Залишились питання? Зв'яжіться з нами!",
      teltext: "Телефонуйте нам:",
      tel: "+38(067)-565-00-07",
      subtitle: "Пишіть нам на пошту:",
      mail: "tov.remresurs@gmail.com",
      description: "Юридична та поштова адреса:",
      adres: "49000, м. Дніпро, Аеродром 8",
    },
    footers: {
      rights: "© 2024 РЕМРЕСУРС. Всі права захищені.",
      erdp: "ЄДРПОУ 39041002",
    },
    company: "РЕМРЕСУРС",
    navlinks: ["Головна", "Про нас", "Переваги", "Контакти"],
  },
  eng: {},
};
